# Homebrew Taps (Third-party repositories)
tap "buo/cask-upgrade"  # Tools for upgrading casks
tap "d12frosted/emacs-plus"  # Emacs Plus - enhanced Emacs builds
tap "homebrew/autoupdate"  # Automatic Homebrew updates
tap "homebrew/bundle"  # Bundler for Homebrew (Brewfile support)
tap "homebrew/services"  # Manage background services with launchctl
tap "jakehilborn/jakehilborn"  # Display management tools
tap "kegworks-app/kegworks"  # Kegworks application repository
tap "microsoft/git"  # Microsoft Git with VFS for Git support
tap "rcmdnk/file"  # Brewfile management tools
tap "xenodium/macosrec"  # macOS screen recording tools

# Development Libraries
brew "libpng"  # Library for manipulating PNG images
brew "gcc"  # GNU Compiler Collection
brew "giflib"  # Library for reading and writing GIF images
brew "libtiff"  # TIFF library and utilities
brew "m4"  # Macro processing language
brew "grpc"  # Next generation RPC framework
brew "binutils"  # GNU binary tools for native development
brew "pkgconf"  # Package compiler and linker metadata toolkit
brew "gobject-introspection"  # Generate introspection data for GObject libraries
brew "jansson"  # C library for encoding, decoding and manipulating JSON
brew "jpeg"  # Image manipulation library
brew "ldns"  # DNS library supporting various RR types
brew "libgccjit"  # JIT library for the GNU compiler collection
brew "librsvg"  # Library to render SVG files using Cairo
brew "libxml2"  # GNOME XML library
brew "poppler"  # PDF rendering library
brew "protobuf@21"  # Protocol buffers - Google's data interchange format
brew "gnutls"  # GNU Transport Layer Security library
brew "harfbuzz"  # OpenType text shaping engine
brew "pango"  # Framework for layout and rendering of i18n text
brew "gdk-pixbuf"  # Toolkit for image loading and pixel buffer manipulation
brew "qt"  # Cross-platform application and UI framework

# AI & Development Tools
brew "basedpyright"  # Type checker for Python (Pyright fork)
brew "bear"  # Generate compilation database for clang tooling
brew "ccls"  # C/C++/ObjC language server
brew "cmake"  # Cross-platform make
brew "cmake-docs"  # Documentation for CMake
brew "eask-cli"  # CLI for building, running, testing, and managing Emacs packages
brew "pyright"  # Static type checker for Python
brew "python-lsp-server"  # Python Language Server for the Language Server Protocol
brew "typescript-language-server"  # Language server for TypeScript
brew "bash-language-server"  # Language server for Bash
brew "ruff"  # Extremely fast Python linter and formatter
brew "prettier"  # Code formatter for JavaScript, CSS, JSON, etc
brew "proselint"  # Linter for prose
brew "pre-commit" # add git pre-commit links

# Shell & Terminal Tools
brew "antidote"  # Plugin manager for zsh
brew "bash"  # Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion"  # Programmable completion for Bash
brew "bat"  # Cat clone with syntax highlighting and Git integration
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "dash-shell"  # POSIX-compliant shell faster than bash
brew "direnv"  # Load/unload environment variables based on $PWD
brew "diffutils"  # File comparison utilities
brew "fd"  # Simple, fast and user-friendly alternative to find
brew "fzf"  # Command-line fuzzy finder
brew "gawk"  # GNU awk utility
brew "gnu-sed"  # GNU version of sed (more powerful than macOS sed)
brew "grep"  # GNU grep, egrep and fgrep
brew "htop"  # Improved top (interactive process viewer)
brew "keychain"  # User-friendly front-end to ssh-agent
brew "less"  # Pager program similar to more
brew "make"  # GNU make utility to maintain groups of programs
brew "most"  # Powerful paging program
brew "nano"  # Free (GNU) replacement for the Pico text editor
brew "mg"  # Small Emacs-like editor
brew "ripgrep"  # Search tool like grep and The Silver Searcher
brew "rsync"  # Utility that provides fast incremental file transfer
brew "screen"  # Terminal multiplexer with VT100/ANSI terminal emulation
brew "stow"  # Organize software neatly under a single directory tree
brew "the_silver_searcher"  # Code-search similar to ack
brew "tlrc"  # Official tldr client written in Rust
brew "tree-sitter"  # Parser generator tool and incremental parsing library
brew "watch"  # Executes a program periodically, showing output fullscreen
brew "zsh"  # UNIX shell (command interpreter)

# Version Control & GitHub
brew "git"  # Distributed revision control system
brew "git-delta"  # Syntax-highlighting pager for git and diff output
brew "gh"  # GitHub command-line tool
brew "hub"  # Add GitHub support to git on the command-line
brew "github-keygen"  # Bootstrap GitHub SSH configuration
brew "subversion"  # Version control system

# Python Development
brew "ipython"  # Interactive computing in Python
brew "pipenv"  # Python dependency management tool
brew "pipx"  # Execute binaries from Python packages in isolated environments
brew "pyenv"  # Python version management
brew "pyenv-virtualenv"  # Pyenv plugin to manage virtualenv
brew "pygments"  # Generic syntax highlighter
brew "virtualenv"  # Virtual Python environment builder

# System Utilities
brew "autoconf"  # Automatic configure script builder
brew "automake"  # Tool for generating GNU Standards-compliant Makefiles
brew "arp-scan"  # ARP scanning and fingerprinting tool
brew "exiftool"  # Perl library for reading and writing EXIF metadata
brew "fastfetch"  # Fast system information tool like neofetch
brew "file-formula"  # Determine file type
brew "gnu-tar"  # GNU version of the tar archiving utility
brew "gnupg"  # GNU Privacy Guard - a PGP replacement
brew "gpatch"  # Apply a diff file to an original
brew "gzip"  # Popular GNU data compression program
brew "jq"  # Lightweight and flexible command-line JSON processor
brew "onefetch"  # Git repository summary on your terminal
brew "openssh"  # OpenBSD freely-licensed SSH connectivity tools
brew "pass"  # Password manager using gpg and git
brew "pinentry-mac"  # Pinentry for GPG on Mac
brew "pngpaste"  # Paste PNG into files from clipboard
brew "rename"  # Perl-powered file rename script with many helpful features
brew "speedtest-cli"  # Command-line interface for testing internet bandwidth
brew "terminal-notifier"  # Send macOS User Notifications from the command-line
brew "unzip"  # Extraction utility for .zip compressed archives
brew "wget"  # Internet file retriever
brew "wireguard-tools"  # Tools for WireGuard VPN

# Documentation & Text Processing
brew "aspell"  # Spell checker with better logic than ispell
brew "enchant"  # Spellchecker wrapping library
brew "markdownlint-cli"  # Command-line interface for MarkdownLint
brew "multimarkdown"  # Turn marked-up plain text into well-formatted documents
brew "pandoc"  # Swiss-army knife of markup format conversion
brew "texinfo"  # Official documentation format of the GNU project

# Media & Graphics
brew "ffmpeg"  # Play, record, convert, and stream audio and video
brew "imagemagick"  # Tools and libraries to manipulate images
brew "gnuplot"  # Command-driven, interactive function plotting

# Network & Communication
brew "irssi"  # Modular IRC client
brew "msmtp"  # SMTP client that can be used as an SMTP plugin for Mutt
brew "samba"  # SMB/CIFS file, print, and login server for UNIX
brew "websocat"  # Command-line client for web sockets

# Programming Languages & Runtimes
brew "go"  # Open source programming language to build simple/reliable/efficient software
brew "node"  # Platform built on V8 to build network applications
brew "perl"  # Highly capable, feature-rich programming language
brew "rustup"  # Rust toolchain installer
brew "sbcl"  # Steel Bank Common Lisp system

# Embedded & Hardware
brew "arduino-cli"  # Arduino command-line interface
brew "avrdude"  # Download/upload/manipulate the ROM and EEPROM contents of AVR microcontrollers
brew "platformio"  # Professional collaborative platform for embedded development

# Special/Niche Tools
brew "gemini-cli"  # CLI client for Gemini Protocol

# Custom Emacs Builds
brew "d12frosted/emacs-plus/emacs-plus@31", args: ["with-dbus", "with-debug", "with-imagemagick", "with-no-frame-refocus", "with-xwidgets"]  # Emacs 31 with enhanced features (dbus, debug symbols, ImageMagick, xwidgets)

# Custom Taps
brew "jakehilborn/jakehilborn/displayplacer"  # macOS command-line utility to configure multi-display resolutions and arrangements
brew "rcmdnk/file/brew-file"  # Brewfile manager for Homebrew
brew "xenodium/macosrec/macosrec"  # Screencasting tool for macOS

# Casks (macOS Applications)
cask "arduino-ide"  # Electronics prototyping platform - IDE
cask "bettertouchtool"  # Customize input devices and toolbars for macOS
cask "blockblock"  # Monitor common persistence locations for malware
cask "cocoarestclient"  # Free, native HTTP/REST client for macOS
cask "do-not-disturb"  # Control Do Not Disturb mode
cask "filebot"  # Rename and organize movies, TV shows, and anime
cask "flycut"  # Clipboard manager for developers
cask "font-hack"  # Typeface designed for source code
cask "font-hack-nerd-font"  # Hack font with extra glyphs (Nerd Fonts)
cask "font-iosevka"  # Versatile typeface for code
cask "font-iosevka-nerd-font" # Iosevka font with extra glyphs (Nerd Fonts)
cask "font-meslo-for-powerlevel10k"  # Font for Powerlevel10k prompt
cask "git-credential-manager"  # Secure Git credential storage for macOS and Windows
cask "google-chrome"  # Web browser
cask "iina"  # Modern media player for macOS
cask "iterm2"  # Terminal emulator for macOS
cask "itsycal"  # Tiny menu bar calendar
cask "karabiner-elements"  # Keyboard customizer for macOS
cask "knockknock"  # See what's persistently installed on your Mac
cask "lulu"  # Open-source firewall to block unknown outgoing connections
cask "maccy"  # Lightweight clipboard manager for macOS
cask "mactex-no-gui"  # TeX distribution for macOS without GUI applications
cask "monitorcontrol"  # Control external monitor brightness and volume
cask "mqtt-explorer"  # MQTT client and MQTT browser
cask "musicbrainz-picard"  # Music tagger
cask "netiquette"  # Network utility app
cask "openscad"  # Programmers' solid 3D CAD modeller
cask "oversight"  # Monitor mic and webcam usage
cask "pearcleaner"  # Uninstaller and app cleaner
cask "qlcolorcode"  # QuickLook plugin for source code with syntax highlighting
cask "qlmarkdown"  # QuickLook plugin for Markdown files
cask "qlstephen"  # QuickLook plugin for plain text files without extension
cask "qlvideo"  # QuickLook plugin for video files
cask "quicklook-json"  # QuickLook plugin for JSON files
cask "quicklookase"  # QuickLook plugin for Adobe Swatch Exchange files
cask "raspberry-pi-imager"  # Tool to write Raspberry Pi OS images to SD cards
cask "reikey"  # Keylogger detection app
cask "rocket"  # Emoji picker
cask "suspicious-package"  # Inspect installer packages
cask "taskexplorer"  # Task manager and system monitor
cask "vanilla"  # Hide menu bar icons
cask "vlc"  # Multimedia player
cask "webpquicklook"  # QuickLook plugin for WebP image files
