tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "gcenx/wine"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jakehilborn/jakehilborn"
tap "microsoft/git"
tap "xenodium/macosrec"
brew "antidote"
brew "giflib"
brew "libpng"
brew "libtiff"
brew "arduino-cli"
brew "arp-scan"
brew "aspell"
brew "m4"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "bash"
brew "bash-completion"
brew "node"
brew "bash-language-server"
brew "grpc"
brew "bear"
brew "binutils"
brew "ccls"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "dash"
brew "diffutils"
brew "direnv"
brew "enchant"
brew "exiftool"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "file-formula"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-ssh"
brew "github-keygen"
brew "gnu-tar"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "gpatch"
brew "grep"
brew "gzip"
brew "htop"
brew "hub"
brew "imagemagick"
brew "irssi"
brew "jansson"
brew "jpeg"
brew "jq"
brew "keychain"
brew "ldns"
brew "less"
brew "libgccjit"
brew "librsvg"
brew "libxml2"
brew "links"
brew "make"
brew "markdownlint-cli"
brew "most"
brew "msmtp"
brew "mysql"
brew "nano"
brew "openssh"
brew "pandoc"
brew "pass"
brew "perl"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "platformio"
brew "poppler"
brew "proselint"
brew "protobuf@21"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyright"
brew "python@3.9"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "samba"
brew "sbcl"
brew "screen"
brew "screenfetch"
brew "smartmontools"
brew "speedtest-cli"
brew "stow"
brew "subversion"
brew "terminal-notifier"
brew "texinfo"
brew "the_silver_searcher"
brew "tree-sitter"
brew "typescript-language-server"
brew "unzip"
brew "virtualenv"
brew "watch"
brew "websocat"
brew "wget"
brew "wireguard-tools"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-dbus", "with-debug", "with-imagemagick", "with-native-comp", "with-xwidgets"]
brew "jakehilborn/jakehilborn/displayplacer"
brew "xenodium/macosrec/macosrec"
cask "arduino-ide"
cask "bettertouchtool"
cask "cocoarestclient"
cask "cscreen"
cask "filebot"
cask "flycut"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-meslo-for-powerlevel10k"
cask "git-credential-manager"
cask "git-credential-manager"
cask "google-chrome"
cask "gstreamer-framework"
cask "hiddenbar"
cask "karabiner-elements"
cask "kegworks"
cask "mactex-no-gui"
cask "monitorcontrol"
cask "mqtt-explorer"
cask "openscad"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "raspberry-pi-imager"
cask "suspicious-package"
cask "vlc"
cask "webpquicklook"
