antidote
arduino-cli
arp-scan
aspell
automake
avrdude
awk
bash
bash-language-server
bear
binutils
ccls
cmake
cmake-docs
d12frosted/emacs-plus/emacs-plus@30
dash
diffutils
exiftool
file-formula
fzf
gawk
gcc
gdb
gh
git
git-ssh
github-keygen
gnu-sed
gnu-tar
gnupg
go
gobject-introspection
gpatch
grep
guile
gzip
hub
jakehilborn/jakehilborn/displayplacer
jq
keychain
less
libelf
libftdi0
libhid
libxml2
llvm
llvm@13
make
markdownlint-cli
most
msmtp
nano
openjdk
openssh
pandoc
perl
pinentry-mac
pipenv
platformio
poppler
proselint
pyenv-virtualenv
pyright
qt
rapidjson
rename
ripgrep
rsync
rustup-init
sbcl
scons
screen
screenfetch
smartmontools
stow
subversion
swig
terminal-notifier
texinfo
the_silver_searcher
unzip
virtualenv
watch
wget
zsh
