tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jakehilborn/jakehilborn"
tap "microsoft/git"
brew "antidote"
brew "arduino-cli"
brew "arp-scan"
brew "aspell"
brew "m4"
brew "automake"
brew "avrdude"
brew "bash"
brew "bear"
brew "binutils"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "llvm"
brew "ccls"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "dash"
brew "diffutils"
brew "file-formula"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "github-keygen"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gpatch"
brew "gzip"
brew "harfbuzz"
brew "imagemagick"
brew "keychain"
brew "ldns"
brew "less"
brew "pango"
brew "make"
brew "most"
brew "msmtp"
brew "nano"
brew "node"
brew "openssh"
brew "perl"
brew "pinentry-mac"
brew "platformio"
brew "poppler"
brew "proselint"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyright"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "sbcl"
brew "screen"
brew "screenfetch"
brew "smartmontools"
brew "stow"
brew "subversion"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "unzip"
brew "virtualenv"
brew "watch"
brew "wget"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-no-frame-refocus"]
brew "jakehilborn/jakehilborn/displayplacer"
cask "arduino"
cask "arduino-ide"
cask "bettertouchtool"
cask "cscreen"
cask "flycut"
cask "git-credential-manager-core"
cask "google-chrome"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "mqtt-explorer"
cask "openscad"
cask "vlc"
