tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/services"
tap "xenodium/macosrec"
brew "antidote"
brew "arduino-cli"
brew "aspell"
brew "autoconf"
brew "automake"
brew "basedpyright"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "enchant"
brew "fastfetch"
brew "ffmpeg"
brew "gh"
brew "git-delta"
brew "htop"
brew "keychain"
brew "make"
brew "markdownlint-cli"
brew "most"
brew "multimarkdown"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "poppler"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "pyright"
brew "python-lsp-server"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "screenfetch"
brew "stow"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr", link: false
brew "tlrc"
brew "tree-sitter"
brew "daviderestivo/emacs-head/emacs-head@31", args: ["with-cocoa", "with-crash-debug", "with-dbus", "with-imagemagick", "with-mailutils", "with-mps", "with-native-comp", "with-native-full-aot", "with-tree-sitter", "with-xwidgets"]
brew "xenodium/macosrec/macosrec"
cask "bettertouchtool"
cask "flycut"
cask "font-iosevka"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "mactex"
cask "rocket"
cask "vanilla"
cask "xquartz"
